In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.read_csv('https://download.bls.gov/pub/time.series/cu/cu.item',sep='\t')

In [29]:
type(df)

pandas.core.frame.DataFrame

In [3]:
df.head()

  item_code  ... sort_sequence
0       AA0  ...             2
1      AA0R  ...           399
2       SA0  ...             1
3      SA0E  ...           374
4     SA0L1  ...           358

[5 rows x 5 columns]

In [4]:
df.tail()

    item_code  ... sort_sequence
394   SS68023  ...           352
395   SSEA011  ...           314
396  SSFV031A  ...           122
397   SSGE013  ...           355
398   SSHJ031  ...           165

[5 rows x 5 columns]

In [5]:
df.shape

(399, 5)

In [8]:
df['item_name']

0                                   All items - old base
1      Purchasing power of the consumer dollar - old ...
2                                              All items
3                                                 Energy
4                                    All items less food
                             ...
394     Tax return preparation and other accounting fees
395                                    College textbooks
396             Food at elementary and secondary schools
397                                   Infants' equipment
398                                   Infants' furniture
Name: item_name, Length: 399, dtype: object

In [7]:
df[['item_code','item_name']]

    item_code                                          item_name
0         AA0                               All items - old base
1        AA0R  Purchasing power of the consumer dollar - old ...
2         SA0                                          All items
3        SA0E                                             Energy
4       SA0L1                                All items less food
..        ...                                                ...
394   SS68023   Tax return preparation and other accounting fees
395   SSEA011                                  College textbooks
396  SSFV031A           Food at elementary and secondary schools
397   SSGE013                                 Infants' equipment
398   SSHJ031                                 Infants' furniture

[399 rows x 2 columns]

In [9]:
df.loc[300]

item_code                      SETB01
item_name        Gasoline (all types)
display_level                       3
selectable                          T
sort_sequence                     222
Name: 300, dtype: object

In [12]:
df.iloc[50:59,2:5]

    display_level selectable  sort_sequence
50              1          T            156
51              1          T            376
52              0          T            250
53              1          T            251
54              1          T            256
55              1          T            378
56              1          T            370
57              1          T            379
58              1          T            381

In [15]:
df.iloc[40:45,3:5].values

array([['T', 94],
       ['T', 125],
       ['T', 335],
       ['T', 339],
       ['T', 383]], dtype=object)

In [16]:
df.isnull()

     item_code  item_name  display_level  selectable  sort_sequence
0        False      False          False       False          False
1        False      False          False       False          False
2        False      False          False       False          False
3        False      False          False       False          False
4        False      False          False       False          False
..         ...        ...            ...         ...            ...
394      False      False          False       False          False
395      False      False          False       False          False
396      False      False          False       False          False
397      False      False          False       False          False
398      False      False          False       False          False

[399 rows x 5 columns]

In [17]:
df.isnull().sum()

item_code        0
item_name        0
display_level    0
selectable       0
sort_sequence    0
dtype: int64

In [20]:
df['display_level'].value_counts()

3    113
2     70
1     66
4     43
6     37
5     37
7     18
0     12
8      3
Name: display_level, dtype: int64

In [22]:
df['selectable'].unique()

array(['T'], dtype=object)

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 399 entries, 0 to 398
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   item_code      399 non-null    object
 1   item_name      399 non-null    object
 2   display_level  399 non-null    int64
 3   selectable     399 non-null    object
 4   sort_sequence  399 non-null    int64
dtypes: int64(2), object(3)
memory usage: 15.7+ KB

In [24]:
df.describe()

       display_level  sort_sequence
count     399.000000     399.000000
mean        3.192982     200.000000
std         1.817102     115.325626
min         0.000000       1.000000
25%         2.000000     100.500000
50%         3.000000     200.000000
75%         4.000000     299.500000
max         8.000000     399.000000

In [27]:
df[df['display_level']>7]

    item_code                               item_name  ...  selectable sort_sequence
325   SS04011              Bacon and related products  ...           T            34
326   SS04012  Breakfast sausage and related products  ...           T            35
327   SS04031                   Ham, excluding canned  ...           T            37

[3 rows x 5 columns]

In [28]:
df.corr()

               display_level  sort_sequence
display_level        1.00000       -0.70548
sort_sequence       -0.70548        1.00000

In [30]:
df.dropna(axis=0)

    item_code  ... sort_sequence
0         AA0  ...             2
1        AA0R  ...           399
2         SA0  ...             1
3        SA0E  ...           374
4       SA0L1  ...           358
..        ...  ...           ...
394   SS68023  ...           352
395   SSEA011  ...           314
396  SSFV031A  ...           122
397   SSGE013  ...           355
398   SSHJ031  ...           165

[399 rows x 5 columns]

In [31]:
df.dropna(axis=1)

    item_code  ... sort_sequence
0         AA0  ...             2
1        AA0R  ...           399
2         SA0  ...             1
3        SA0E  ...           374
4       SA0L1  ...           358
..        ...  ...           ...
394   SS68023  ...           352
395   SSEA011  ...           314
396  SSFV031A  ...           122
397   SSGE013  ...           355
398   SSHJ031  ...           165

[399 rows x 5 columns]

In [33]:
df['item_name'][88]

"Men's footwear"